{
    "finales": [
        {
            "nombre": "Final 1er FEB 2022 ",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "Teórico"
                },
                {
                    "pregunta": "Cual es el valor hexadecimal que corresponde la suma de C(16)+C(16)+1(16)",
                    "respuesta": "19(16)"
                },
                {
                    "pregunta": "Cuales son las 3 microoperaciones necesarias y consecutivas para que se produzca una escritura en RAM desde CPU. ",
                    "respuesta": "DIR -> MAR <br> DATA->MDR <br> R/W' -> 0"
                },
                {
                    "pregunta": "Cual es la utilidad del registro de banderas o registro de estado en modo real y modo protegido",
                    "respuesta": "Conocer el estado de la cpu despues de la ultima operacion"
                },
                {
                    "pregunta": "Cual es la utilidad de los registros FS y GS",
                    "respuesta": ""
                },
                {
                    "pregunta": "De un ejemplo de una instruccion de salto que se vincule siempre con una de retorno",
                    "respuesta": "CALL/ RET    INT/ IRET"
                },
                {
                    "pregunta": "Como se expresa la unidad de tiempo correspondiente a 10^-9",
                    "respuesta": "ns (nanosegundo)"
                },
                {
                    "pregunta": "Cual es nombre generico de un circutio que permite iidentificar una unica combinacion binaria para n entradas? Cuantas salidas tiene el circuto?",
                    "respuesta": "Decodificador, 2^n salidas"
                },
                {
                    "pregunta": "Como se denomina el registro que decrementa la ejecucion de la instruccion LOOP para contar las iteraciones realizadas y salir del ciclo cuando su valor llega a cero",
                    "respuesta": "CX"
                },
                {
                    "esSeparador": true,
                    "texto": "Práctica"
                },
                {
                    "pregunta": "Para acceder a una placa de memoria de 16 chips se utiliza un circuito decodificador que permite seleccionar uno de ellos entre 16. Cada chip esta organizado como una matriz de 2Gx8 de acceso random y direccionable al byte. <br>1. Cuantos bits de la DF se utilizan como entradas a este decodificador para la seleccion del chip? Cuantos para la seleccion del byte? <br>Cuantos bits tiene la direccion fisica en total? <br>Cuantos GB tiene de capacidad la memoria?",
                    "respuesta": "1. 4 bits para la entrada del decodificador y 31 bits para seleccion del byte <br>2. 35bits <br>3. 32GB"
                },
                {
                    "pregunta": "Un procesador está relacionado a una caché asociativa de una via constituida por 8 líneas con 8 bytes cada una (Se describe la misma en la figura abajo), y está relacionado con a una RAM de 512*8. Se realiza un acceso de lectura con la dirección 1F2. Indicar si hay éxito o no. En caso de haber éxito, indicar el valor accedido y en el caso de haber ausencia indicar el número de línea a la cual se produce la sustitución del bloque de RAM accedido.",
                    "respuesta": "No se encuentra, se actualiza la linea 6"
                },
                {
                    "pregunta": "Indique en binario decimal y hexadecimal la dirección física que permite acceder con éxito a la linea identificada con el n° 0 y obtener el byte cuyo contenido es 32",
                    "respuesta": "101000100 -> 144"
                },
                {
                    "pregunta": "Para la línea de código presentada a continuación <code> 07C4:0104 XOR BX,BX </code><br><code> 0701:0108 INC BX  </code><br><code> 0704: 010B JC 0100 </code><br>Desconociendo el valor inicial de BX ¿Cual es el valor final de BX? ",
                    "respuesta": "BX = 1"
                },
                {
                    "pregunta": "Si el salto se produjo ¿Cuál fue el valor de la bandera C y qué condición representa? ",
                    "respuesta": "C=0 representa si en la ultima operacion hubo carry"
                },
                {
                    "esImagen": true,
                    "texto": "mem-feb-22.jpg"
                }
            ]
        },
        {
            "nombre": "Final 2019",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "Teórico"
                },
                {
                    "pregunta": "Desde que lugar se extraen los valores que permiten la restauración de los registros de CPU para una tarea entrante?",
                    "respuesta": "ESTRUCTURA DE DATOS PILA "
                },
                {
                    "pregunta": "Nombre dos registros de CPU que se utilicen en el campo desplazamiento de una dirección virtual? ",
                    "respuesta": "EIP ESP"
                },
                {
                    "pregunta": "Cuál es la finalidad de los registros SI y DI en modo real?",
                    "respuesta": "I SE UTILIZAN EN DIRECCIONAMIENTO INDEXADO"
                },
                {
                    "pregunta": "Cómo se denominan los registros que se pueden utilizar como registros base",
                    "respuesta": "REGISTROS DE SEGMENTO"
                },
                {
                    "pregunta": "A qué hace referencia el concepto MODO directo por registro o de registro ",
                    "respuesta": "AL MODO EN EL QUE EL OPERANDO SE ALOJA EN UN REGISTRO DE CPU "
                },
                {
                    "pregunta": "Si el campo EDATA de una instrucción es de 32 bits y aloja un dato (modo inmediato) cuál es su valor máximo entero? Escríbalo en hexadecimal o en potencias de 2 ",
                    "respuesta": "2 N - 1 "
                },
                {
                    "pregunta": "Qué es un hercio o Hz? ",
                    "respuesta": "MEDIDA DE FRECUENCIA - CICLOS POR SEGUNDO "
                },
                {
                    "pregunta": "Cómo se denomina la señal que indica la solicitud de atención por parte de un dispositivo externo? ",
                    "respuesta": "INTR "
                },
                {
                    "pregunta": "Cómo clasificaría una interrupción producida por una división por cero? ",
                    "respuesta": "I EXCEPCION "
                },
                {
                    "esSeparador": true,
                    "texto": "Práctica"
                },
                {
                    "pregunta": "Sabiendo que la direccion fisica de la ultima posicion de una memoria es FF FF FF FF Cual es el valor de m de esa memoria si es direccionable al octeto? (o dicho de otra manera de m X 8) m= 4G posiciones",
                    "respuesta": "32GB"
                },
                {
                    "pregunta": "Indique el correspondiente el rango de direcciones.",
                    "respuesta": "[0, 232-1]"
                },
                {
                    "pregunta": "Para la línea de código presentada a continuación y considerando un contexto en modo real (o modo 16 bits) <code>3BB0:0103 MOV AX, [35B0]</code>  Si el valor del DS es AB55 cuál es la dirección física del operando involucrado en ésta instrucción?",
                    "respuesta": "AEBOO"
                },
                {
                    "pregunta": "Si el valor del SS es 3700 y el valor del SP es FFFE cuál será la dirección segmentada asociada al byte vacío de la pila luego de una instrucción PUSH",
                    "respuesta": "3700:FFFC"
                },
                {
                    "pregunta": "Si la instrucción siguiente a la descripta se aloja en la dirección física 3BC07, Cual es el tamaño de la instrucción y cuantos bytes le corresponden al código de operación?",
                    "respuesta": "4 bytes instrucción/ 2 bytes código de operación y 2 bytes del campo de referencia al dato 35B0"
                },
                {
                    "pregunta": "Un proceso que se ejecuta en un sistema con memoria virtual puramente segmentada tiene un primer segmento de código de 4096 bytes.  ¿Qué valor del campo límite del correspondiente descriptor de segmento?",
                    "respuesta": "01000(16) = 0000 0001 0000 0000 0000 (2)"
                },
                {
                    "pregunta": "¿Qué valor tiene el bit P de presencia cuando la CPU está ejecutando la tercera instrucción?",
                    "respuesta": "P=1"
                },
                {
                    "pregunta": "Si el valor del campo base correspondiente al mismo descriptor y expresada en hexadecimal es 00 00 10 00. ¿Cuál es la dirección física que correspondería al último byte del segmento?",
                    "respuesta": "00001FFF"
                }
            ]
        },
        {
            "nombre": "Final 2019.2",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "Teoria"
                },
                {
                    "pregunta": "¿Cuáles son los dos criterios que sustentan la alta probabilidad de acierto en memoria cache?",
                    "respuesta": "VECINDAD ESPACIAL Y TEMPORAL"
                },
                {
                    "pregunta": "Definición genérica para todos los tipos de error que pueden generar las instrucciones que operan datos en convenio de punto flotante TFFF, 754",
                    "respuesta": "EXCEPCION"
                },
                {
                    "pregunta": "Indique como mínimo cuatro unidades que constituyen el procesador Pentium",
                    "respuesta": "SUBSISTEMA CACHE UNIDAD DE ENTEROS SUPERESCALAR FPU SISTEMA DE PREDICCION DE SALTOS Y BIU"
                },
                {
                    "pregunta": "Registros de 32 bits que se asocian al acceso modo de direccionamiento indexado",
                    "respuesta": "EDI ESI"
                },
                {
                    "pregunta": "Modo de direccionamiento en el que el operando se encuentra directamente definido en el campo de referencia a dato de la instrucción, dé un ejemplo.",
                    "respuesta": "INMEDIATO"
                },
                {
                    "pregunta": "Memoria ultrarrápida que guarda la dirección lineal y la dirección fisica de las últimas 32 páginas de código accedidas",
                    "respuesta": "TLB"
                },
                {
                    "pregunta": "Método de sustitución de una línea de cache en una organización de correspondencia directa o asociativa de una vía.",
                    "respuesta": "NINGUNO"
                },
                {
                    "pregunta": "Indique la denominación genérica para las peticiones de interrupción de los periféricos al PIC que permiten determinar la prioridad del mismo para ser atendido.",
                    "respuesta": "IRQ"
                },
                {
                    "esSeparador": true,
                    "texto": "Practica"
                },
                {
                    "pregunta": "Convierta la siguiente cadena hexadecimal a notación little endian. 87654321",
                    "respuesta": "21436587"
                },
                {
                    "pregunta": "Si el resultado obtenido se interpreta como el contenido de un vector de interrupción en modo real ¿Que información se ahnacenara en el CS y que información en el IP cuando se convoque al servicio apuntado?",
                    "respuesta": "CS =2163 IP =6587"
                },
                {
                    "pregunta": "¿En cuantos frames de página se puede dividir una memoria de 6G si la página es de 4K ?",
                    "respuesta": "6/4 M"
                },
                {
                    "pregunta": "Si un bloque de código ocupa 4098 bytes ¿cuántas páginas utiliza?",
                    "respuesta": "2"
                },
                {
                    "pregunta": "Un proceso que se ejecuta en un sistema con memoria virtual con segmentos paginados.¿Qué atributo determina que este segmento esta paginado y qué información brinda el descriptor de segmento en su campo limite?",
                    "respuesta": "BIT G / CANTIDAD DE PAGINAS"
                },
                {
                    "pregunta": "Si en solo una de las entradas de una Tabla Directorio de Paginas se cuenta con información valida (o referente a tablas de pagina) ¿a cuántas tablas de página se puede acceder?",
                    "respuesta": "A UNA"
                },
                {
                    "pregunta": "Para la propuesta anterior ¿A cuantas paginas se podría ser acceder como maximo considerando que el campo puntero (o índice) de tabla de pagina es de 10 bits?",
                    "respuesta": "1024 PAGINAS"
                },
                {
                    "pregunta": "Para la propuesta anterior ¿Cuál sería la capacidad máxima de almacenamiento que se puede administrar si las páginas son de 8K?",
                    "respuesta": "8 M"
                }
            ]
        },
        {
            "nombre": "Final3-2019",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "teoria"
                },
                {
                    "pregunta": "Cómo se denomina la estructura de datos que se utiliza en determinadas ocasiones, para resguardar el contenido de los registros de CPU",
                    "respuesta": "Pila o Stack"
                },
                {
                    "pregunta": "Cuál es el nombre genérico de la técnica para actualizar la memoria principal desde caché. Cuál es la denominación particular cuando se escribe en MP al mismo tiempo que en caché.",
                    "respuesta": "Política de Escritura // Write through o escritura inmediata"
                },
                {
                    "pregunta": "Cuál es la fmalidad de los \"registros de segmento\" en modo real y en modo protegido?",
                    "respuesta": "En modo real contienen la entidad \"base\" de la dirección segmentada// En modo protegido contiene el selector."
                },
                {
                    "pregunta": "Cómo se denomina el registro que actúa como \"contador de programa\" o \"puntero de instrucción y de cuántos bits puede constar?",
                    "respuesta": "IP (Instruction Pointer, de 16 bits) // EIP (Extended IP de 32 bits)"
                },
                {
                    "pregunta": "Donde se encuentra el operando cuando se utiliza direccionamiento inmediato?",
                    "respuesta": "En la misma instrucción, como referencia de operando."
                },
                {
                    "pregunta": "Qué es el Buffer de Traducción Anticipada yb qué información se guarda en este dispositivo?",
                    "respuesta": "Es una memoria de reducida capacidad que guarda dirección lineal y la dirección física de las últimas 32 páginas de código accedidas dentro de un microprocesador"
                },
                {
                    "pregunta": "En qué unidad se mide el ciclo completo de una instrucción?",
                    "respuesta": "En ciclos de reloj"
                },
                {
                    "pregunta": "Cómo se denomina la señal de respuesta de la CPU a la solicitud de atención por parte de un dispositivo externo. Qué módulo especial gestiona las señales provenientes del entorno de dispositivos ?",
                    "respuesta": "INTA (Interrupt Aknowledge) // La gestión la realiza el APIC"
                },
                {
                    "pregunta": "Cómo se denomina el parámetro que indica la cantidad de bits que se transmiten por unidad de tiempo a través de un bus yen qué unidades se mide?",
                    "respuesta": "Velocidad de transferencia. Se mide en Megabit/s o Gigabit/s"
                },
                {
                    "esSeparador": true,
                    "texto": "practica"
                },
                {
                    "pregunta": "Sabiendo que una CPU genera una dirección de 34 bits que permiten acceder a la memoria principal Cuál es el tamaño potencial de la memoria principal",
                    "respuesta": "16 Giga"
                },
                {
                    "pregunta": "¿Cuántos bits son significativos para direccionar una memoria DRAM de 8 Gigabytes?",
                    "respuesta": "33 bits"
                },
                {
                    "pregunta": "Si el total de los 8 Giga están distribuidos en cuatro placas de 8 chips cada una ¿Cómo esta armada la matriz de inX8 en cada chip y cual es la capacidad de cada uno?",
                    "respuesta": "Es de 256MX8 y tiene una capacidad de 256 MB"
                },
                {
                    "pregunta": "Un proceso que se ejecuta en un sistema con memoria virtual puramente segmentada tiene un primer segmento de código de 4096 bytes.¿Cuánto vale el campo el campo P de presencia cuando el programa está ejecutando la tercera instrucción?",
                    "respuesta": "Bit P de presencia activo o en 1"
                },
                {
                    "pregunta": "¿Qué valor de la entidad \"selector\" de la dirección virtual permite acceder al segmento?",
                    "respuesta": "El Indice de Tabla —TI, bit 2 del selector que estaré en 0, indicando que la Tabla de Descriptores es Local"
                },
                {
                    "pregunta": "¿Qué valor tiene el bit G de Granulaiidad?",
                    "respuesta": "Desactivado en 0, ya que el tamaño máximo del segmento se expresa en bytes"
                },
                {
                    "pregunta": "Si la base alojada en su descriptor y expresada en hexadecimal es 32 42 70 00.",
                    "respuesta": "¿Cuál es la dirección física que correspondería al Ultimo byte del segmento?"
                },
                {
                    "pregunta": "32 42 70 00 + FFFF = 32 42 7F FF",
                    "respuesta": "Para la línea de código presentada a continuación <code>AB55:0103 MOV AX, [AAAA]</code> Si la instrucción siguiente a la descripta se aloja en la dirección física AB656 Cual es el tamaño de la instrucción y cuantos bytes le corresponden al código de operación?"
                }
            ]
        },
        {
            "nombre": "febrero2019",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "teoria"
                },
                {
                    "pregunta": "Cómo se denomina la estructura de datos que se utiliza en determinadas ocasiones, para resguardar el contenido de los registros de CPU",
                    "respuesta": "Pila o Stack"
                },
                {
                    "pregunta": "Cuál es el nombre genérico de la técnica para actualizar la memoria principal desde caché. Cuál es la denominación particular cuando se escribe en MP al mismo tiempo que en caché.",
                    "respuesta": "Política de Escritura // Write through o escritura inmediata"
                },
                {
                    "pregunta": "Cuál es la fmalidad de los \"registros de segmento\" en modo real y en modo protegido?",
                    "respuesta": "En modo real contienen la entidad \"base\" de la dirección segmentada// En modo protegido contiene el selector."
                },
                {
                    "pregunta": "Cómo se denomina el registro que actúa como \"contador de programa\" o \"puntero de instrucción y de cuántos bits puede constar?",
                    "respuesta": "IP (Instruction Pointer, de 16 bits) // EIP (Extended IP de 32 bits)"
                },
                {
                    "pregunta": "Donde se encuentra el operando cuando se utiliza direccionamiento inmediato?",
                    "respuesta": "En la misma instrucción, como referencia de operando."
                },
                {
                    "pregunta": "Qué es el Buffer de Traducción Anticipada yb qué información se guarda en este dispositivo?",
                    "respuesta": "Es una memoria de reducida capacidad que guarda dirección lineal y la dirección física de las últimas 32 páginas de código accedidas dentro de un microprocesador"
                },
                {
                    "pregunta": "En qué unidad se mide el ciclo completo de una instrucción?",
                    "respuesta": "En ciclos de reloj"
                },
                {
                    "pregunta": "Cómo se denomina la señal de respuesta de la CPU a la solicitud de atención por parte de un dispositivo externo. Qué módulo especial gestiona las señales provenientes del entorno de dispositivos ?",
                    "respuesta": "INTA (Interrupt Aknowledge) // La gestión la realiza el APIC"
                },
                {
                    "pregunta": "Cómo se denomina el parámetro que indica la cantidad de bits que se transmiten por unidad de tiempo a través de un bus yen qué unidades se mide?",
                    "respuesta": "Velocidad de transferencia. Se mide en Megabit/s o Gigabit/s"
                },
                {
                    "esSeparador": true,
                    "texto": "practica"
                },
                {
                    "pregunta": "Sabiendo que una CPU genera una dirección de 34 bits que permiten acceder a la memoria principal Cuál es el tamaño potencial de la memoria principal",
                    "respuesta": "16 Giga"
                },
                {
                    "pregunta": "¿Cuántos bits son significativos para direccionar una memoria DRAM de 8 Gigabytes?",
                    "respuesta": "33 bits"
                },
                {
                    "pregunta": "Si el total de los 8 Giga están distribuidos en cuatro placas de 8 chips cada una ¿Cómo esta armada la matriz de inX8 en cada chip y cual es la capacidad de cada uno?",
                    "respuesta": "Es de 256MX8 y tiene una capacidad de 256 MB"
                },
                {
                    "pregunta": "Un proceso que se ejecuta en un sistema con memoria virtual puramente segmentada tiene un primer segmento de código de 4096 bytes.¿Cuánto vale el campo el campo P de presencia cuando el programa está ejecutando la tercera instrucción?",
                    "respuesta": "Bit P de presencia activo o en 1"
                },
                {
                    "pregunta": "¿Qué valor de la entidad \"selector\" de la dirección virtual permite acceder al segmento?",
                    "respuesta": "El Indice de Tabla —TI, bit 2 del selector que estaré en 0, indicando que la Tabla de Descriptores es Local"
                },
                {
                    "pregunta": "¿Qué valor tiene el bit G de Granulaiidad?",
                    "respuesta": "Desactivado en 0, ya que el tamaño máximo del segmento se expresa en bytes"
                },
                {
                    "pregunta": "Si la base alojada en su descriptor y expresada en hexadecimal es 32 42 70 00.",
                    "respuesta": "¿Cuál es la dirección física que correspondería al Ultimo byte del segmento?"
                },
                {
                    "pregunta": "32 42 70 00 + FFFF = 32 42 7F FF",
                    "respuesta": "Para la línea de código presentada a continuación <code>AB55:0103 MOV AX, [AAAA]</code> Si la instrucción siguiente a la descripta se aloja en la dirección física AB656 Cual es el tamaño de la instrucción y cuantos bytes le corresponden al código de operación?"
                }
            ]
        }
    ]
}