{
    "finales": [
        {
            "nombre": "Final 01/12/2016",
            "preguntas": [
                {
                    "esSeparador": true,
                    "texto": "Teórico"
                },
                {
                    "pregunta": "Cual es el valor hexadecimal que corresponde la suma de C(16)+C(16)+1(16)",
                    "respuesta": "19(16)"
                },
                {
                    "pregunta": "Cuales son las 3 microoperaciones necesarias y consecutivas para que se produzca una escritura en RAM desde CPU. ",
                    "respuesta": ""
                },
                {
                    "pregunta": "Cual es la utilidad del registro de banderas o registro de estado en modo real y modo protegido",
                    "respuesta": ""
                },
                {
                    "pregunta": "Cual es la utilidad de los registros FS y GS",
                    "respuesta": ""
                },
                {
                    "pregunta": "De un ejemplo de una instruccion de salto que se vincule siempre con una de retorno",
                    "respuesta": "CALL/ RET    INT/ IRET"
                },
                {
                    "pregunta": "Como se expresa la unidad de tiempo correspondiente a 10^-9",
                    "respuesta": "ns (nanosegundo)"
                },
                {
                    "pregunta": "Cual es nombre generico de un circutio que permite iidentificar una unica combinacion binaria para n entradas? Cuantas salidas tiene el circuto?",
                    "respuesta": "Decodificador, 2^n salidas"
                },
                {
                    "pregunta": "Como se denomina el registro que decrementa la ejecucin de la instruccion LOOP para contar las iteraciones realizadas y salir del ciclo cuando su valor llega a cero",
                    "respuesta": "CX"
                },
                
                {
                    "esSeparador": true,
                    "texto": "Práctica"
                },
                {
                    "pregunta": "Para acceder a una placa de memoria de 16 chips se utiliza un circuito decodificador que permite seleccionar uno de ellos entre 16. Cada chip esta organizado como una matriz de 2Gx8 de acceso randome y direccionable al byte. <br>1. Cuantos bits de la DF se utilizan como entradas a este decodificador para la seleccion del chip? Cuantos para la seleccion del byte? <br>Cuantos bits tiene la direccion fisica en total? <br>Cuantos GB tiene de capacidad la memoria?",
                    "respuesta": "AEB00"
                },
                {
                    "pregunta": "Un procesador está relacionado a una caché asociativa de una via constituida por 8 líneas con 8 bytes cada una (Se describe la misma en la figura abajo), y está relacionado con a una RAM de 512*8. Se realiza un acceso de lectura con la dirección 1F2. Indicar si hay éxito o no. En caso de haber éxito, indicar el valor accedido y en el caso de haber ausencia indicar el número de línea a la cual se produce la sustitución del bloque de RAM accedido." ,
                    "respuesta":""
                },
                {
                    "pregunta": "Indique en binario decimal y hexadecimal la dirección física que permite acceder con éxito a la linea identificada con el n° 0 y obtener el byte cuyo contenido es 32" ,
                    "respuesta": ""
                },
                {
                    "pregunta": "Para la línea de código presentada a continuación <code> 07C4:0104 XOR BX,BX </code><br><code> 0701:0108 INC BX  </code><br><code> 0704: 010B JC 0100 </code><br>Desconociendo el valor inicial de BX ¿Cual es el valor final de BX? " ,
                    "respuesta": ""
                },
                {
                    "pregunta": "Si el salto se produjo ¿Cuál fue el valor de la bandera S y qué condición representa? "  ,
                    "respuesta":  ""
                },
                {
                    "esImagen": true,
                    "texto": "mem-feb-22.jpg"
                }
                
                ]
        }
    ]
}
